In [3]:
import pandas as pd

In [4]:
# Series 
s1=pd.Series([10,20,300])
print(s1)

0     10
1     20
2    300
dtype: int64

In [5]:
# From Dictionary
dic ={"a":10,"b":20,"c":30}
s2=pd.Series(dic)
print(s2)

a    10
b    20
c    30
dtype: int64

In [6]:

l1=[10,20,30]
l2=[100,200,300]
s3=pd.Series(l2,l1) # first values ,then index
print(s3)

10    100
20    200
30    300
dtype: int64

In [7]:
# From Dictionary
dic={
	"Name" : ["Ahemad","Tafheem","Aleem"],
	"Age" : [10,20,40],
	"City" : ["Rourkela","Khordha","Kerange"]
}

df1=pd.DataFrame(dic)
print(df1)

      Name  Age      City
0   Ahemad   10  Rourkela
1  Tafheem   20   Khordha
2    Aleem   40   Kerange

In [8]:

mat=[
	{"Name":"Tafheem","Age":50,"City":"Khordha"},
	{"Name":"Aleem","Age":12,"City":"Kerange"},
	{"Name":"Ahemad","Age":20,"City":"Rourkela"}
]

df2=pd.DataFrame(mat)
print(df2)

      Name  Age      City
0  Tafheem   50   Khordha
1    Aleem   12   Kerange
2   Ahemad   20  Rourkela

In [9]:
df2.describe()

             Age
count   3.000000
mean   27.333333
std    20.033306
min    12.000000
25%    16.000000
50%    20.000000
75%    35.000000
max    50.000000

In [10]:
df2["Salary"]=[5000,4000,5000]
df2

      Name  Age      City  Salary
0  Tafheem   50   Khordha    5000
1    Aleem   12   Kerange    4000
2   Ahemad   20  Rourkela    5000

In [11]:
df2.drop('Salary',axis=1,inplace=True) # we need inplace for permanately change
df2

      Name  Age      City
0  Tafheem   50   Khordha
1    Aleem   12   Kerange
2   Ahemad   20  Rourkela

In [12]:
df2['Age']=[1,1,1]
df2

      Name  Age      City
0  Tafheem    1   Khordha
1    Aleem    1   Kerange
2   Ahemad    1  Rourkela

In [13]:
df2['Age']=50+df2['Age']
df2

      Name  Age      City
0  Tafheem   51   Khordha
1    Aleem   51   Kerange
2   Ahemad   51  Rourkela

In [14]:
df2['Name']

0    Tafheem
1      Aleem
2     Ahemad
Name: Name, dtype: object

In [15]:
df2.loc[0] #for inddexing like it given in dictionary

Name    Tafheem
Age          51
City    Khordha
Name: 0, dtype: object

In [16]:
df2.iloc[0] #for indexing like first second third

Name    Tafheem
Age          51
City    Khordha
Name: 0, dtype: object

In [ ]:
df2.at[2,'Age']=50 # Changeing perticular value
df2.at[2,'Age']

50

In [25]:
df2.iat[2,2]="NITR"
df2.iat[2,2]

'NITR'

In [26]:
df2

      Name  Age     City
0  Tafheem   51  Khordha
1    Aleem   51  Kerange
2   Ahemad   50     NITR

In [17]:
df3=pd.read_csv('sales_data.csv')
df3.head(10)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
5,10006,2024-01-06,Sports,Wilson Evolution Basketball,5,29.99,149.95,Asia,Credit Card
6,10007,2024-01-07,Electronics,MacBook Pro 16-inch,1,2499.99,2499.99,North America,Credit Card
7,10008,2024-01-08,Home Appliances,Blueair Classic 480i,2,599.99,1199.98,Europe,PayPal
8,10009,2024-01-09,Clothing,Nike Air Force 1,6,89.99,539.94,Asia,Debit Card
9,10010,2024-01-10,Books,Dune by Frank Herbert,2,25.99,51.98,North America,Credit Card

In [18]:
df3.tail(4)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card